<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"3a195c64486923159d01f424cbba5e38e20f35c198e57b91a112e97b3938a090","plan_job_ref":"Job Terraform Plan #85 at https://github.com/ironashram/kub1k/actions/runs/11326193853","plan_out_hash":"62ca5566305725b0732b150ff3b03eb092fd902abee0b7525dbe0466779ac358","plan_hash":"71975bfe1a88ea6ac04eed6ac5aafa7dacf4c01ff0720a25284e410f66acd4b6","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-09-30T15:49:25Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #85](https://github.com/ironashram/kub1k/actions/runs/11326193853)